miniproject0/case3/system/blockMeshDict1RB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 0 0)     //0
    (4 0 0)     //1
    (4 1 0)     //2
    (0 1 0)     //3
    (0 0 0.1)   //4
    (4 0 0.1)   //5
    (4 1 0.1)   //6
    (0 1 0.1)   //7
    //(4 -1 0)    //8cA
    //(6 -1 0)    //8cB
    //(7 -1 0)    //8cC
    (__RAMP__ -1 0)    //8
    (16 -1 0)   //9
    (16 1 0)    //10
    //(4 -1 0.1)  //11cA
    //(6 -1 0.1)  //11cB
    //(7 -1 0.1)    //11cC
    (__RAMP__ -1 0.1)  //11
    (16 -1 0.1) //12
    (16 1 0.1)  //13
    (16 0 0)    //14
    (16 0 0.1)  //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) b4expansion (100 25 1) simpleGrading 
    (
        0.3333
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b0
    hex (1 14 10 2 5 15 13 6) aftexpansion1 (300 25 1) simpleGrading
    (
        3
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b1
    hex (8 9 14 1 11 12 15 5) aftexpansion2 (300 25 1) simpleGrading
    (
        3
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b2
);

boundary
(
    wallL
    {
        type wall;
        faces
        (
            (2 3 7 6)   //b0
            (10 2 6 13) //b1
        );
    }
    wallR
    {
        type wall;
        faces
        (
            (0 1 5 4)   //b0
            (8 9 12 11) //b2
        );
    }
    wallExpansion
    {
        type wall;
        faces
        (
            (1 8 11 5)  //b1
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)   //b0
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 10 13 15)    //b1
            (9 14 15 12)     //b2
        );
    }
    twoD
    {
        type empty;
        faces
        (
            (4 5 6 7)   //b0
            (0 3 2 1)   //b0
            (5 15 13 6) //b1
            (2 10 14 1) //b1
            (5 11 12 15) //b2
            (1 14 9 8)  //b2
        );
    }
);


// ************************************************************************* //
